#lang reader "leadraw.rkt"

交差点　右前　(list 左　右　右前)
交差点　前　(list 左後ろ 前)
直進　２５ｍ
十字路　前
直進　２５ｍ
十字路　前
直進　２５ｍ
T字路　左
直進　３０ｍ
十字路　右
直進　２０ｍ
カーブ　左
直進　２５ｍ
カーブ　右後ろ
直進　２５ｍ
交差点　左　(list 左 前)
直進　３０ｍ
交差点　前　(list 前　右後ろ)
直進　１０ｍ
交差点　右前　(list 左　右前)
直進　５ｍ
交差点　前 (list 右 前)
直進　５ｍ
カーブ　左前
カーブ　右前
交差点　前　(list 右 前)
直進　５ｍ
交差点　右前　(list 左 右前)
直進　５ｍ
交差点　左前　(list 左後ろ 左前)
直進　５ｍ
カーブ　左前
直進　５ｍ
カーブ　右前
直進　５ｍ
交差点　左前 (list 左前 右前)
直進　７ｍ
交差点　前　(list 左　前)
直進　５０ｍ
交差点　左前　(list 左　左前　右後ろ)
直進　５０ｍ
交差点　左前　(list 左前 右後ろ)
直進　５ｍ
交差点　右　(list 右　前)
直進　５０ｍ
交差点　右前　(list 右後ろ　右前　左前)
直進　３０ｍ
交差点 右前　(list 左　左前　右前　右)
直進　３ｍ